vke/nrf52840_dimmer_rgbw_thread/thread_coap_utils.c
/**
 * Copyright (c) 2017-2019 - 2020, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include "thread_coap_utils.h"

#include "app_timer.h"
#include "bsp_thread.h"
#include "nrf_assert.h"
#include "sdk_config.h"
#include "thread_utils.h"

#include "settings.h"

#include "tinycbor/cbor.h"

#include <openthread/ip6.h>
#include <openthread/link.h>
#include <openthread/thread.h>
#include <openthread/icmp6.h>
#include <openthread/platform/alarm-milli.h>
#include <openthread/platform/misc.h>

APP_TIMER_DEF(m_led_send_timer);
APP_TIMER_DEF(m_led_recv_timer);
APP_TIMER_DEF(m_boot_timer);
APP_TIMER_DEF(m_poll_period_fast_timer);

static otIcmp6Handler m_icmp6_handler;

static void bsp_send_led_timer_handler(void * p_context)
{
	bsp_board_led_off(LED_SEND_NOTIFICATION);
}

static void bsp_recv_led_timer_handler(void * p_context)
{
	bsp_board_led_off(LED_RECV_NOTIFICATION);
}

void blink_recv_led()
{
	uint32_t err_code;
	bsp_board_led_on(LED_RECV_NOTIFICATION);
	err_code = app_timer_start(m_led_recv_timer, APP_TIMER_TICKS(25), NULL);
}

void blink_send_led()
{
	uint32_t err_code;
	bsp_board_led_on(LED_SEND_NOTIFICATION);
	err_code = app_timer_start(m_led_send_timer, APP_TIMER_TICKS(25), NULL);
}

static void icmp_receive_callback(void                * p_context,
								  otMessage           * p_message,
								  const otMessageInfo * p_message_info,
								  const otIcmp6Header * p_icmp_header)
{
	if (p_icmp_header->mType == OT_ICMP6_TYPE_ECHO_REQUEST) {
		blink_recv_led();
	}
}

static uint32_t m_poll_period = 0;

static void boot_request_handler(void *, otMessage *, const otMessageInfo *);
static void info_request_handler(void *, otMessage *, const otMessageInfo *);
static void set_request_handler(void *, otMessage *, const otMessageInfo *);
static void get_request_handler(void *, otMessage *, const otMessageInfo *);
static void sub_request_handler(void *, otMessage *, const otMessageInfo *);

static otCoapResource m_boot_resource = { .mUriPath = "boot", .mHandler = boot_request_handler, .mContext = NULL, .mNext = NULL, };
static otCoapResource m_info_resource = { .mUriPath = "info", .mHandler = info_request_handler, .mContext = NULL, .mNext = NULL, };
static otCoapResource m_set_resource = { .mUriPath = "set", .mHandler = set_request_handler, .mContext = NULL, .mNext = NULL, };
static otCoapResource m_get_resource = { .mUriPath = "get", .mHandler = get_request_handler, .mContext = NULL, .mNext = NULL, };
static otCoapResource m_sub_resource = { .mUriPath = "sub", .mHandler = sub_request_handler, .mContext = NULL, .mNext = NULL, };

APP_TIMER_DEF(m_subscription_timer);

static subscription_settings_data subscription_settings = {
	.subscription_address = {0},
	.subscription_interval = 1000,
	.last_sent_at = 0,
};

extern sensor_subscription sensor_subscriptions[];

bool set_sensor_value(char sensor_name, int64_t sensor_value, bool external_request)
{
	for (int i = 0; sensor_subscriptions[i].sensor_name != SENSOR_SUBSCRIPTION_NAME_LAST; i++) {
		if (sensor_subscriptions[i].sensor_name == sensor_name) {
			sensor_subscriptions[i].initialized = true;
			if (external_request) {
				sensor_subscriptions[i].sent_value = sensor_value;
				sensor_subscriptions[i].current_value = sensor_value;
				if (sensor_subscriptions[i].set_value_handler)
					sensor_subscriptions[i].set_value_handler(sensor_name, sensor_value);
			} else {
				sensor_subscriptions[i].current_value = sensor_value;
			}
			return true;
		}
	}
	return false;
}

bool get_sensor_value(char sensor_name, int64_t *p_sensor_value)
{
	for (int i = 0; sensor_subscriptions[i].sensor_name != SENSOR_SUBSCRIPTION_NAME_LAST; i++) {
		if (sensor_subscriptions[i].sensor_name == sensor_name) {
			if (sensor_subscriptions[i].initialized == false)
				return false;
			*p_sensor_value = sensor_subscriptions[i].current_value;
			return true;
		}
	}
	return false;
}

bool is_sensor_readonly(char sensor_name)
{
	for (int i = 0; sensor_subscriptions[i].sensor_name != SENSOR_SUBSCRIPTION_NAME_LAST; i++) {
		if (sensor_subscriptions[i].sensor_name == sensor_name) {
			return sensor_subscriptions[i].read_only;
		}
	}
	return true;
}

int16_t get_sensor_index(char sensor_name)
{
	for (int i = 0; sensor_subscriptions[i].sensor_name != SENSOR_SUBSCRIPTION_NAME_LAST; i++) {
		if (sensor_subscriptions[i].sensor_name == sensor_name) {
			return i;
		}
	}
	return -1;
}

static uint32_t poll_period_fast_set(void)
{
	uint32_t     error;
	otError      ot_error;
	otInstance * p_instance = thread_ot_instance_get();

	do {
		if (otThreadGetLinkMode(p_instance).mRxOnWhenIdle) {
			error = NRF_ERROR_INVALID_STATE;
			break;
		}

