vke/nrf52840_dimmer_rgbw_thread/thread_coap_utils.c
		if (!m_poll_period) {
			m_poll_period = otLinkGetPollPeriod(p_instance);

			ot_error = otLinkSetPollPeriod(p_instance, DEFAULT_POLL_PERIOD_FAST);
			ASSERT(ot_error == OT_ERROR_NONE);

			error = NRF_SUCCESS;

			app_timer_start(m_poll_period_fast_timer, APP_TIMER_TICKS(DEFAULT_POLL_PERIOD_FAST_TIMEOUT), NULL);
		} else {
			error = NRF_ERROR_BUSY;
		}
	} while (false);

	return error;
}

static void poll_period_restore(void)
{
	otError      error;
	otInstance * p_instance = thread_ot_instance_get();

	do {
		if (otThreadGetLinkMode(p_instance).mRxOnWhenIdle) {
			break;
		}

		if (m_poll_period) {
			error = otLinkSetPollPeriod(p_instance, m_poll_period);
			ASSERT(error == OT_ERROR_NONE);

			m_poll_period = 0;

			app_timer_stop(m_poll_period_fast_timer);
		}
	} while (false);
}

static void poll_period_fast_timer_handler(void * p_context)
{
	UNUSED_PARAMETER(p_context);

	poll_period_restore();
}

static void coap_default_handler(void * p_context, otMessage * p_message, const otMessageInfo * p_message_info)
{
	UNUSED_PARAMETER(p_context);
	UNUSED_PARAMETER(p_message);
	UNUSED_PARAMETER(p_message_info);
}

CborError cbor_encode_map_set_stringz(CborEncoder *p_encoder, const char *key, const char *value)
{
	CborError cborError = cbor_encode_text_stringz(p_encoder, key);
	if (cborError != CborNoError)
		return cborError;
	cborError = cbor_encode_text_stringz(p_encoder, value);
	return cborError;
}

CborError cbor_encode_map_set_int(CborEncoder *p_encoder, const char *key, int64_t value)
{
	CborError cborError = cbor_encode_text_stringz(p_encoder, key);
	if (cborError != CborNoError)
		return cborError;
	cborError = cbor_encode_int(p_encoder, value);
	return cborError;
}

static void boot_timer_handler(void * p_context)
{
	NRF_POWER->GPREGRET = 0xB1;
	NVIC_SystemReset();
}

static otError boot_response_send(otMessage * p_request_message, const otMessageInfo * p_message_info)
{
	otError error = OT_ERROR_NO_BUFS;
	otMessage * p_response;
	otInstance * p_instance = thread_ot_instance_get();

	do {
		p_response = otCoapNewMessage(p_instance, NULL);
		if (p_response == NULL)
			break;

		otCoapMessageInit(p_response, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_CONTENT);

		error = otCoapMessageSetToken(p_response, otCoapMessageGetToken(p_request_message), otCoapMessageGetTokenLength(p_request_message));
		if (error != OT_ERROR_NONE)
			break;

		error = otCoapSendResponse(p_instance, p_response, p_message_info);

	} while (false);

	if (error != OT_ERROR_NONE && p_response != NULL)
		otMessageFree(p_response);

	return error;
}

static void boot_request_handler(void * p_context, otMessage * p_message, const otMessageInfo * p_message_info)
{
	UNUSED_PARAMETER(p_message);

	otError error;
	otMessageInfo message_info;

	if (otCoapMessageGetCode(p_message) == OT_COAP_CODE_POST) {
		message_info = *p_message_info;
		memset(&message_info.mSockAddr, 0, sizeof(message_info.mSockAddr));

		error = boot_response_send(p_message, &message_info);
		if (error == OT_ERROR_NONE) {
		}

		ret_code_t err_code = app_timer_start(m_boot_timer, APP_TIMER_TICKS(1000), NULL);
	}

	blink_recv_led();
}

size_t fill_info_packet(uint8_t *pBuffer, size_t stBufferSize)
{
	CborEncoder encoder;
	CborError cborError = CborNoError;

	cbor_encoder_init(&encoder, pBuffer, stBufferSize, 0);

	CborEncoder encoderMap;

	cborError = cbor_encoder_create_map(&encoder, &encoderMap, CborIndefiniteLength);
	if (cborError != CborNoError)
		return 0;

	cborError = cbor_encode_map_set_stringz(&encoderMap, "t", INFO_FIRMWARE_TYPE);
	if (cborError != CborNoError)
		return 0;

	cborError = cbor_encode_map_set_stringz(&encoderMap, "v", INFO_FIRMWARE_VERSION);
	if (cborError != CborNoError)
		return 0;

	cborError = cbor_encode_map_set_int(&encoderMap, "r", otPlatGetResetReason(thread_ot_instance_get()));
	if (cborError != CborNoError)
		return 0;

	uint8_t macAddr[8];
	otPlatRadioGetIeeeEui64(thread_ot_instance_get(), macAddr);

	cborError = cbor_encode_text_stringz(&encoderMap, "m");
	if (cborError != CborNoError)
		return 0;
	cborError = cbor_encode_byte_string(&encoderMap, macAddr, sizeof(macAddr));
	if (cborError != CborNoError)
		return 0;

	cborError = cbor_encode_text_stringz(&encoderMap, "e");
	if (cborError != CborNoError)
		return 0;
	cborError = cbor_encode_byte_string(&encoderMap, (const uint8_t *)otLinkGetExtendedAddress(thread_ot_instance_get()), sizeof(otExtAddress));
	if (cborError != CborNoError)
		return 0;

	cborError = cbor_encode_text_stringz(&encoderMap, "a");
	if (cborError != CborNoError)
		return 0;
	cborError = cbor_encode_byte_string(&encoderMap, (const uint8_t *)otThreadGetMeshLocalEid(thread_ot_instance_get()), sizeof(otIp6Address));
	if (cborError != CborNoError)
		return 0;

	cborError = cbor_encode_text_stringz(&encoderMap, "s");
	CborEncoder encoderArr;

	cborError = cbor_encoder_create_array(&encoderMap, &encoderArr, CborIndefiniteLength);
	if (cborError != CborNoError)
		return 0;

	for (int i = 0; sensor_subscriptions[i].sensor_name != SENSOR_SUBSCRIPTION_NAME_LAST; i++) {
		cbor_encode_text_string(&encoderArr, &sensor_subscriptions[i].sensor_name, 1);
	}

	cborError = cbor_encoder_close_container(&encoderMap, &encoderArr);
	if (cborError != CborNoError)
		return 0;

	cborError = cbor_encoder_close_container(&encoder, &encoderMap);
	if (cborError != CborNoError)
		return 0;

	return cbor_encoder_get_buffer_size(&encoder, pBuffer);
}

static otError info_response_send(otMessage * p_request_message, const otMessageInfo * p_message_info)
{
	otError error = OT_ERROR_NO_BUFS;
	otMessage * p_response;
	otInstance * p_instance = thread_ot_instance_get();

	do {
		p_response = otCoapNewMessage(p_instance, NULL);
		if (p_response == NULL)
			break;

		otCoapMessageInit(p_response, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_CONTENT);

		error = otCoapMessageSetToken(p_response, otCoapMessageGetToken(p_request_message), otCoapMessageGetTokenLength(p_request_message));
		if (error != OT_ERROR_NONE)
			break;

		error = otCoapMessageAppendContentFormatOption(p_response, OT_COAP_OPTION_CONTENT_FORMAT_CBOR);
		if (error != OT_ERROR_NONE)
			break;

		error = otCoapMessageSetPayloadMarker(p_response);
		if (error != OT_ERROR_NONE)
			break;

		uint8_t buff[256];

		size_t packet_len = fill_info_packet(buff, sizeof(buff));
		if (packet_len == 0)
			break;

