vke/nrf52840_dimmer_rgbw_thread/thread_coap_utils.c
		error = otMessageAppend(p_response, buff, packet_len);
		if (error != OT_ERROR_NONE)
			break;

		error = otCoapSendResponse(p_instance, p_response, p_message_info);

	} while (false);

	if (error != OT_ERROR_NONE && p_response != NULL)
		otMessageFree(p_response);

	return error;
}

static void info_request_handler(void * p_context, otMessage * p_message, const otMessageInfo * p_message_info)
{
	UNUSED_PARAMETER(p_message);

	otError error;
	otMessageInfo message_info;

	if (otCoapMessageGetCode(p_message) == OT_COAP_CODE_GET) {
		message_info = *p_message_info;
		memset(&message_info.mSockAddr, 0, sizeof(message_info.mSockAddr));

		error = info_response_send(p_message, &message_info);
		if (error == OT_ERROR_NONE) {
		}
	}

	blink_recv_led();
}

static void set_response_send(otMessage * p_request_message, const otMessageInfo * p_message_info, const uint8_t *p_buff, size_t buff_size)
{
	otError      error = OT_ERROR_NO_BUFS;
	otMessage  * p_response;
	otInstance * p_instance = thread_ot_instance_get();

	do {
		p_response = otCoapNewMessage(p_instance, NULL);
		if (p_response == NULL)
			break;

		otCoapMessageInit(p_response, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_CONTENT);

		error = otCoapMessageSetToken(p_response, otCoapMessageGetToken(p_request_message), otCoapMessageGetTokenLength(p_request_message));
		if (error != OT_ERROR_NONE)
			break;

		error = otCoapMessageAppendContentFormatOption(p_response, OT_COAP_OPTION_CONTENT_FORMAT_CBOR);
		if (error != OT_ERROR_NONE)
			break;

		error = otCoapMessageSetPayloadMarker(p_response);
		if (error != OT_ERROR_NONE)
			break;

		error = otMessageAppend(p_response, p_buff, buff_size);
		if (error != OT_ERROR_NONE)
			break;

		error = otCoapSendResponse(p_instance, p_response, p_message_info);
	} while (false);

	if ((error != OT_ERROR_NONE) && (p_response != NULL))
		otMessageFree(p_response);
}

static void set_request_handler(void * p_context, otMessage * p_message, const otMessageInfo * p_message_info)
{
	do {
		if (otCoapMessageGetType(p_message) != OT_COAP_TYPE_CONFIRMABLE && otCoapMessageGetType(p_message) != OT_COAP_TYPE_NON_CONFIRMABLE)
			break;

		if (otCoapMessageGetCode(p_message) != OT_COAP_CODE_PUT)
			break;

		uint8_t buff[256];

		uint16_t body_len = otMessageGetLength(p_message) - otMessageGetOffset(p_message);

		if (body_len > sizeof(buff))
			break;

		if (otMessageRead(p_message, otMessageGetOffset(p_message), buff, body_len) != body_len)
			break;

		CborParser parser;
		CborValue it;
		CborError cborError = cbor_parser_init(buff, body_len, 0, &parser, &it);
		if (cborError != CborNoError)
			break;

		if (cbor_value_at_end(&it) || cbor_value_get_type(&it) != CborMapType)
			break;

		CborValue recursed;
		cborError = cbor_value_enter_container(&it, &recursed);
		if (cborError != CborNoError)
			break;

		uint8_t buff_resp[256];
		CborEncoder encoder;
		cbor_encoder_init(&encoder, buff_resp, sizeof(buff_resp), 0);

		CborEncoder encoderMap;
		cborError = cbor_encoder_create_map(&encoder, &encoderMap, CborIndefiniteLength);
		if (cborError != CborNoError)
			break;

		while (!cbor_value_at_end(&recursed)) {
			CborType type = cbor_value_get_type(&recursed);
			if (type != CborTextStringType)
				break;
			char key[256];
			size_t keyLen = sizeof(key);
			CborValue next;
			cborError = cbor_value_copy_text_string(&recursed, key, &keyLen, &next);
			if (key[1] != 0)
				break;
			recursed = next;
			type = cbor_value_get_type(&recursed);
			if (type != CborIntegerType)
				break;
			int64_t val;
			cborError = cbor_value_get_int64(&recursed, &val);
			if (cborError != CborNoError)
				break;

			if (!is_sensor_readonly(key[0])) {
				set_sensor_value(key[0], val, true);
				cbor_encode_map_set_int(&encoderMap, key, val);
			}

			cborError = cbor_value_advance(&recursed);
			if (cborError != CborNoError)
				break;
		}

		cborError = cbor_encoder_close_container(&encoder, &encoderMap);
		if (cborError != CborNoError)
			break;

		if (otCoapMessageGetType(p_message) == OT_COAP_TYPE_CONFIRMABLE) {
			size_t buff_size = cbor_encoder_get_buffer_size(&encoder, buff_resp);
			set_response_send(p_message, p_message_info, buff_resp, buff_size);
		}
	}
	while (false);

	blink_recv_led();
}

static otError get_response_send(otMessage *p_request_message, const otMessageInfo *p_message_info, const uint8_t *p_buff, size_t buff_size)
{
	otError error = OT_ERROR_NO_BUFS;
	otMessage *p_response;
	otInstance *p_instance = thread_ot_instance_get();

	do {
		p_response = otCoapNewMessage(p_instance, NULL);
		if (p_response == NULL)
			break;

		otCoapMessageInit(p_response, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_CONTENT);

		error = otCoapMessageSetToken(p_response, otCoapMessageGetToken(p_request_message), otCoapMessageGetTokenLength(p_request_message));
		if (error != OT_ERROR_NONE)
			break;

		error = otCoapMessageAppendContentFormatOption(p_response, OT_COAP_OPTION_CONTENT_FORMAT_CBOR);
		if (error != OT_ERROR_NONE)
			break;

		error = otCoapMessageSetPayloadMarker(p_response);
		if (error != OT_ERROR_NONE)
			break;

		error = otMessageAppend(p_response, p_buff, buff_size);
		if (error != OT_ERROR_NONE)
			break;

		error = otCoapSendResponse(p_instance, p_response, p_message_info);

	} while (false);

	if (error != OT_ERROR_NONE && p_response != NULL)
		otMessageFree(p_response);

	return error;
}

static void get_request_handler(void *p_context, otMessage *p_message, const otMessageInfo *p_message_info)
{
	do {
		if (otCoapMessageGetType(p_message) != OT_COAP_TYPE_CONFIRMABLE)
			break;

		if (otCoapMessageGetCode(p_message) != OT_COAP_CODE_GET)
			break;

		uint8_t buff_req[256];

		uint16_t body_len = otMessageGetLength(p_message) - otMessageGetOffset(p_message);

		if (body_len > sizeof(buff_req))
			break;

		if (otMessageRead(p_message, otMessageGetOffset(p_message), buff_req, body_len) != body_len)
			break;

		CborParser parser;
		CborValue it;
		CborError cborError = cbor_parser_init(buff_req, body_len, 0, &parser, &it);
		if (cborError != CborNoError)
			break;

