vke/nrf52840_dimmer_rgbw_thread/thread_coap_utils.c
		if (cbor_value_at_end(&it) || cbor_value_get_type(&it) != CborArrayType)
			break;

		CborValue recursed;
		cborError = cbor_value_enter_container(&it, &recursed);
		if (cborError != CborNoError)
			break;

		uint8_t buff_resp[256];
		CborEncoder encoder;
		cbor_encoder_init(&encoder, buff_resp, sizeof(buff_resp), 0);

		CborEncoder encoderMap;
		cborError = cbor_encoder_create_map(&encoder, &encoderMap, CborIndefiniteLength);
		if (cborError != CborNoError)
			break;

		while (!cbor_value_at_end(&recursed))
		{
			CborType type = cbor_value_get_type(&recursed);
			if (type != CborTextStringType)
				break;

			char key[2];
			size_t keyLen = sizeof(key);
			CborValue next;
			cborError = cbor_value_copy_text_string(&recursed, key, &keyLen, &next);
			if (key[1] != 0)
				break;
			recursed = next;

			int64_t sensor_value;
			if (!get_sensor_value(key[0], &sensor_value))
				break;

			cbor_encode_map_set_int(&encoderMap, key, sensor_value);
		}

		cborError = cbor_encoder_close_container(&encoder, &encoderMap);
		if (cborError != CborNoError)
			break;

		if (otCoapMessageGetType(p_message) == OT_COAP_TYPE_CONFIRMABLE) {
			size_t buff_size = cbor_encoder_get_buffer_size(&encoder, buff_resp);
			get_response_send(p_message, p_message_info, buff_resp, buff_size);
		}
	} while (false);

	blink_recv_led();
}

static void sub_response_send(otMessage * p_request_message, const otMessageInfo * p_message_info, const uint8_t *p_buff, size_t buff_size)
{
	otError      error = OT_ERROR_NO_BUFS;
	otMessage  * p_response;
	otInstance * p_instance = thread_ot_instance_get();

	do {
		p_response = otCoapNewMessage(p_instance, NULL);
		if (p_response == NULL)
			break;

		otCoapMessageInit(p_response, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_CONTENT);

		error = otCoapMessageSetToken(p_response, otCoapMessageGetToken(p_request_message), otCoapMessageGetTokenLength(p_request_message));
		if (error != OT_ERROR_NONE)
			break;

		error = otCoapMessageAppendContentFormatOption(p_response, OT_COAP_OPTION_CONTENT_FORMAT_CBOR);
		if (error != OT_ERROR_NONE)
			break;

		error = otCoapMessageSetPayloadMarker(p_response);
		if (error != OT_ERROR_NONE)
			break;

		error = otMessageAppend(p_response, p_buff, buff_size);
		if (error != OT_ERROR_NONE)
			break;

		error = otCoapSendResponse(p_instance, p_response, p_message_info);
	} while (false);

	if ((error != OT_ERROR_NONE) && (p_response != NULL))
		otMessageFree(p_response);
}

static size_t parse_subscriptions(uint8_t *p_request, size_t request_size, uint8_t *p_response, size_t response_size)
{
	uint32_t time_now = otPlatAlarmMilliGetNow();

	for (int i = 0; sensor_subscriptions[i].sensor_name != SENSOR_SUBSCRIPTION_NAME_LAST; i++) {
		sensor_subscriptions[i].disable_reporting = true;
		sensor_subscriptions[i].last_sent_at = time_now;
		sensor_subscriptions[i].sent_value = sensor_subscriptions[i].current_value;
	}

	CborParser parser;
	CborValue it;
	CborError cborError = cbor_parser_init(p_request, request_size, 0, &parser, &it);
	if (cborError != CborNoError)
		return 0;

	if (cbor_value_at_end(&it) || cbor_value_get_type(&it) != CborMapType)
		return 0;

	CborValue recursed;
	cborError = cbor_value_enter_container(&it, &recursed);
	if (cborError != CborNoError)
		return 0;

	CborEncoder encoder;
	cbor_encoder_init(&encoder, p_response, response_size, 0);

	CborEncoder encoderMap;
	cborError = cbor_encoder_create_map(&encoder, &encoderMap, CborIndefiniteLength);
	if (cborError != CborNoError)
		return 0;

	while (!cbor_value_at_end(&recursed)) {
		CborType type = cbor_value_get_type(&recursed);
		if (type != CborTextStringType)
			return 0;

		char key[2];
		size_t keyLen = sizeof(key);
		CborValue next;

		cborError = cbor_value_copy_text_string(&recursed, key, &keyLen, &next);
		if (cborError != CborNoError)
			return 0;
		if (key[1] != 0)
			return 0;

		recursed = next;

		type = cbor_value_get_type(&recursed);
		switch (key[0]) {
			case 'a': {
				if (type != CborByteStringType)
					return 0;
				size_t addr_size = 0;
				cborError = cbor_value_calculate_string_length(&recursed, &addr_size);
				if (cborError != CborNoError)
					return 0;
				if (addr_size != sizeof(otIp6Address))
					return 0;
				addr_size = sizeof(otIp6Address);
				cborError = cbor_value_copy_byte_string(&recursed, subscription_settings.subscription_address.mFields.m8, &addr_size, &next);
				if (cborError != CborNoError)
					return 0;
				if (addr_size != sizeof(otIp6Address))
					return 0;
				recursed = next;
				break;
			}
			case 's': {
				if (type != CborMapType)
					return 0;
				
				CborValue recursedMapS;
				cborError = cbor_value_enter_container(&recursed, &recursedMapS);
				if (cborError != CborNoError)
					return 0;

				while (!cbor_value_at_end(&recursedMapS)) {
					CborType type = cbor_value_get_type(&recursedMapS);
					if (type != CborTextStringType)
						return 0;

					char keyS[2];
					size_t keySLen = sizeof(keyS);

					cborError = cbor_value_copy_text_string(&recursedMapS, keyS, &keySLen, &next);
					if (cborError != CborNoError)
						return 0;
					if (keyS[1] != 0)
						return 0;
					
					int16_t sensor_index = get_sensor_index(keyS[0]);
					if (sensor_index == -1)
						return 0;

					recursedMapS = next;

					if (cbor_value_get_type(&recursedMapS) != CborMapType)
						return 0;

					CborValue recursedMapSR;
					cborError = cbor_value_enter_container(&recursedMapS, &recursedMapSR);
					if (cborError != CborNoError)
						return 0;

					while (!cbor_value_at_end(&recursedMapSR)) {
						CborType type = cbor_value_get_type(&recursedMapSR);
						if (type != CborTextStringType)
							return 0;

						char keySR[2];
						size_t keySRLen = sizeof(keySR);

						cborError = cbor_value_copy_text_string(&recursedMapSR, keySR, &keySRLen, &next);
						if (cborError != CborNoError)
							return 0;

						if (keySR[0] != 'i' && keySR[0] != 'r')
							return 0;
						if (keySR[1] != 0)
							return 0;

						recursedMapSR = next;
						type = cbor_value_get_type(&recursedMapSR);
						if (type != CborIntegerType)
							return 0;
						int64_t val;
						cborError = cbor_value_get_int64(&recursedMapSR, &val);
						if (cborError != CborNoError)
							return 0;
						cborError = cbor_value_advance(&recursedMapSR);
						if (cborError != CborNoError)
							return 0;

						if (keySR[0] == 'i')
							sensor_subscriptions[sensor_index].report_interval = (uint32_t)val;
						else if (keySR[0] == 'r')
							sensor_subscriptions[sensor_index].reportable_change = val;
					}

					cborError = cbor_value_leave_container(&recursedMapS, &recursedMapSR);
					if (cborError != CborNoError)
						return 0;

					sensor_subscriptions[sensor_index].disable_reporting = false;
				}

