vke/nrf52840_dimmer_rgbw_thread/thread_coap_utils.c
				cborError = cbor_value_leave_container(&recursed, &recursedMapS);
				if (cborError != CborNoError)
					return 0;
				
				break;
			}
			default:
				return 0;
		}
	}

	cborError = cbor_encoder_close_container(&encoder, &encoderMap);
	if (cborError != CborNoError)
		return 0;

	return cbor_encoder_get_buffer_size(&encoder, p_response);
}

static void sub_request_handler(void * p_context, otMessage * p_message, const otMessageInfo * p_message_info)
{
	do {
		if (otCoapMessageGetType(p_message) != OT_COAP_TYPE_CONFIRMABLE && otCoapMessageGetType(p_message) != OT_COAP_TYPE_NON_CONFIRMABLE)
			break;

		if (otCoapMessageGetCode(p_message) != OT_COAP_CODE_PUT)
			break;

		uint8_t buff_request[256];

		uint16_t request_size = otMessageGetLength(p_message) - otMessageGetOffset(p_message);

		if (request_size > sizeof(buff_request))
			break;

		if (otMessageRead(p_message, otMessageGetOffset(p_message), buff_request, request_size) != request_size)
			break;

		uint8_t buff_response[256];

		size_t response_size = parse_subscriptions(buff_request, request_size, buff_response, sizeof(buff_response));

		if (response_size == 0)
			break;

		if (otCoapMessageGetType(p_message) == OT_COAP_TYPE_CONFIRMABLE)
			set_response_send(p_message, p_message_info, buff_response, response_size);
	}
	while (false);

	blink_recv_led();
}

static void subscription_response_handler(void                * p_context,
										  otMessage           * p_message,
										  const otMessageInfo * p_message_info,
										  otError               result)
{
	poll_period_restore();
}

static void send_subscription_broadcast()
{
	otError       error = OT_ERROR_NONE;
	otMessage   * p_request;
	otMessageInfo message_info;
	otInstance  * p_instance = thread_ot_instance_get();

	do {
		p_request = otCoapNewMessage(p_instance, NULL);
		if (p_request == NULL)
			break;

		otCoapMessageInit(p_request, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_POST);

		error = otCoapMessageAppendUriPathOptions(p_request, "up");
		if (error != OT_ERROR_NONE)
			break;

		error = otCoapMessageAppendContentFormatOption(p_request, OT_COAP_OPTION_CONTENT_FORMAT_CBOR);
		if (error != OT_ERROR_NONE)
			break;

		error = otCoapMessageSetPayloadMarker(p_request);
		if (error != OT_ERROR_NONE)
			break;

		uint8_t buff[256];

		size_t packet_len = fill_info_packet(buff, sizeof(buff));
		if (packet_len == 0)
			break;

		error = otMessageAppend(p_request, buff, packet_len);
		if (error != OT_ERROR_NONE)
			break;

		memset(&message_info, 0, sizeof(message_info));
		message_info.mPeerPort = OT_DEFAULT_COAP_PORT;

		error = otIp6AddressFromString("ff03::1", &message_info.mPeerAddr);
		if (error != OT_ERROR_NONE)
			break;

		error = otCoapSendRequest(p_instance, p_request, &message_info, subscription_response_handler, p_instance);
		if (error != OT_ERROR_NONE)
			break;

		poll_period_fast_set();

		blink_send_led();
	} while (false);

	if (error != OT_ERROR_NONE && p_request != NULL)
		otMessageFree(p_request);
}

size_t fill_subscriptions_packet(uint32_t time_now, uint8_t *pBuffer, size_t stBufferSize)
{
	CborEncoder encoder;
	CborError cborError = CborNoError;

	cbor_encoder_init(&encoder, pBuffer, stBufferSize, 0);

	CborEncoder encoderMap;

	cborError = cbor_encoder_create_map(&encoder, &encoderMap, CborIndefiniteLength);
	if (cborError != CborNoError)
		return 0;

	bool data_added = false;

	for (int i = 0; sensor_subscriptions[i].sensor_name != SENSOR_SUBSCRIPTION_NAME_LAST; i++) {
		if (sensor_subscriptions[i].disable_reporting)
			continue;

		if (sensor_subscriptions[i].initialized == false)
			continue;

		bool add = false;
		if (sensor_subscriptions[i].last_sent_at + sensor_subscriptions[i].report_interval < time_now)
			add = true;
		else if ((sensor_subscriptions[i].current_value > sensor_subscriptions[i].sent_value) &&
			((sensor_subscriptions[i].current_value - sensor_subscriptions[i].sent_value) > sensor_subscriptions[i].reportable_change))
			add = true;
		else if ((sensor_subscriptions[i].sent_value > sensor_subscriptions[i].current_value) &&
			(sensor_subscriptions[i].sent_value - sensor_subscriptions[i].current_value) > sensor_subscriptions[i].reportable_change)
			add = true;

		if (add) {
			data_added = true;

			sensor_subscriptions[i].last_sent_at = time_now;
			sensor_subscriptions[i].sent_value = sensor_subscriptions[i].current_value;

			char key[2] = {sensor_subscriptions[i].sensor_name, 0};

			cbor_encode_map_set_int(&encoderMap, key, sensor_subscriptions[i].current_value);
		}
	}

	if (!data_added)
		return 0;

	cborError = cbor_encoder_close_container(&encoder, &encoderMap);
	if (cborError != CborNoError)
		return 0;

	return cbor_encoder_get_buffer_size(&encoder, pBuffer);
}

static void subscription_timeout_handler(void *p_context)
{
	UNUSED_PARAMETER(p_context);

	otDeviceRole device_role = otThreadGetDeviceRole(thread_ot_instance_get());
	if (device_role != OT_DEVICE_ROLE_CHILD && device_role != OT_DEVICE_ROLE_ROUTER && device_role != OT_DEVICE_ROLE_LEADER)
		return;

	if (subscription_settings.subscription_address.mFields.m32[0] == 0xFFFFFFFF &&
		subscription_settings.subscription_address.mFields.m32[1] == 0xFFFFFFFF &&
		subscription_settings.subscription_address.mFields.m32[2] == 0xFFFFFFFF &&
		subscription_settings.subscription_address.mFields.m32[3] == 0xFFFFFFFF) {
			return;
	}

	uint32_t time_now = otPlatAlarmMilliGetNow();

	if (otIp6IsAddressUnspecified(&subscription_settings.subscription_address)) {
		if (subscription_settings.last_sent_at + subscription_settings.subscription_interval > time_now)
			return;
		subscription_settings.last_sent_at = time_now;
		if (subscription_settings.subscription_interval < 60000)
			subscription_settings.subscription_interval *= 2;
		send_subscription_broadcast();
		return;
	}

	uint8_t buff[256];

	size_t buff_size = fill_subscriptions_packet(time_now, buff, sizeof(buff));
	if (buff_size == 0)
		return;

	otError       error = OT_ERROR_NONE;
	otMessage   * p_request;
	otMessageInfo message_info;
	otInstance  * p_instance = thread_ot_instance_get();

	do {
		p_request = otCoapNewMessage(p_instance, NULL);
		if (p_request == NULL)
			break;

		otCoapMessageInit(p_request, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_POST);

		error = otCoapMessageAppendUriPathOptions(p_request, "rep");
		if (error != OT_ERROR_NONE)
			break;

		error = otCoapMessageAppendContentFormatOption(p_request, OT_COAP_OPTION_CONTENT_FORMAT_CBOR);
		if (error != OT_ERROR_NONE)
			break;

