vke/nrf52840_dimmer_rgbw_thread/thread_coap_utils.c
		error = otCoapMessageSetPayloadMarker(p_request);
		if (error != OT_ERROR_NONE)
			break;

		error = otMessageAppend(p_request, buff, buff_size);
		if (error != OT_ERROR_NONE)
			break;

		memset(&message_info, 0, sizeof(message_info));
		message_info.mPeerPort = OT_DEFAULT_COAP_PORT;

		message_info.mPeerAddr.mFields.m32[0] = subscription_settings.subscription_address.mFields.m32[0];
		message_info.mPeerAddr.mFields.m32[1] = subscription_settings.subscription_address.mFields.m32[1];
		message_info.mPeerAddr.mFields.m32[2] = subscription_settings.subscription_address.mFields.m32[2];
		message_info.mPeerAddr.mFields.m32[3] = subscription_settings.subscription_address.mFields.m32[3];

		error = otCoapSendRequest(p_instance, p_request, &message_info, NULL, NULL);
		if (error != OT_ERROR_NONE)
			break;
		
		blink_send_led();
	} while (false);

	if (error != OT_ERROR_NONE && p_request != NULL)
		otMessageFree(p_request);
}

void thread_coap_utils_init()
{
	otInstance * p_instance = thread_ot_instance_get();

	otError error = otCoapStart(p_instance, OT_DEFAULT_COAP_PORT);
	ASSERT(error == OT_ERROR_NONE);

	otCoapSetDefaultHandler(p_instance, coap_default_handler, NULL);

	m_boot_resource.mContext = p_instance;
	m_info_resource.mContext = p_instance;
	m_set_resource.mContext = p_instance;
	m_get_resource.mContext = p_instance;
	m_sub_resource.mContext = p_instance;

	error = otCoapAddResource(p_instance, &m_boot_resource);
	ASSERT(error == OT_ERROR_NONE);

	error = otCoapAddResource(p_instance, &m_info_resource);
	ASSERT(error == OT_ERROR_NONE);

	error = otCoapAddResource(p_instance, &m_set_resource);
	ASSERT(error == OT_ERROR_NONE);

	error = otCoapAddResource(p_instance, &m_get_resource);
	ASSERT(error == OT_ERROR_NONE);

	error = otCoapAddResource(p_instance, &m_sub_resource);
	ASSERT(error == OT_ERROR_NONE);

	uint32_t error_code = app_timer_create(&m_subscription_timer, APP_TIMER_MODE_REPEATED, subscription_timeout_handler);
	APP_ERROR_CHECK(error_code);

	error_code = app_timer_start(m_subscription_timer, APP_TIMER_TICKS(SUBSCRIPTION_TIMER_INTERVAL), NULL);
	APP_ERROR_CHECK(error_code);

	error_code = app_timer_create(&m_led_recv_timer, APP_TIMER_MODE_SINGLE_SHOT, bsp_recv_led_timer_handler);
	APP_ERROR_CHECK(error_code);

	error_code = app_timer_create(&m_led_send_timer, APP_TIMER_MODE_SINGLE_SHOT, bsp_send_led_timer_handler);
	APP_ERROR_CHECK(error_code);

	error_code = app_timer_create(&m_boot_timer, APP_TIMER_MODE_SINGLE_SHOT, boot_timer_handler);
	APP_ERROR_CHECK(error_code);

	error_code = app_timer_create(&m_poll_period_fast_timer, APP_TIMER_MODE_SINGLE_SHOT, poll_period_fast_timer_handler);
	APP_ERROR_CHECK(error_code);

	memset(&m_icmp6_handler, 0, sizeof(m_icmp6_handler));
	m_icmp6_handler.mReceiveCallback = icmp_receive_callback;

	error = otIcmp6RegisterHandler(thread_ot_instance_get(), &m_icmp6_handler);
	ASSERT((error == OT_ERROR_NONE) || (error == OT_ERROR_ALREADY));
}
